/*
    TODO
    Сделать привязку через DI(самостоятельно написанный DI на reflection)
    чтобы обрабатывать пользователей, и предметы

    Создать отдельный класс для сборка статистики и собственный коллектор
 */

public class Warehouse {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}